       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB06.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WRK-PRODUTO  PIC X(20)        VALUE SPACES.
       77  WRK-UF       PIC X(02)        VALUE SPACES.
       77  WRK-VALOR    PIC 9(06)V99     VALUE ZEROS.
       77  WRK-FRETE    PIC 9(04)V99     VALUE ZEROS.
       PROCEDURE DIVISION.
           DISPLAY 'PRODUTO.. '
           ACCEPT WRK-PRODUTO.
           DISPLAY 'VALOR.. '
           ACCEPT WRK-VALOR.
           DISPLAY 'ESTADO.. '
           ACCEPT WRK-UF.
           EVALUATE WRK-UF
           WHEN 'SP'
           COMPUTE WRK-FRETE = (WRK-VALOR * 1.10)
           WHEN 'RJ'
           COMPUTE WRK-FRETE = (WRK-VALOR * 1.20)
           WHEN 'SC'
           COMPUTE WRK-FRETE = (WRK-VALOR * 1.30)
           WHEN OTHER
           DISPLAY 'NAO ENTREGAMOS'
           END-EVALUATE.
           DISPLAY 'VALOR DO FRETE COM PRODUTO ' WRK-FRETE.
           STOP RUN.
      
